<div class="sticky top-0 z-50" x-data="{ isScrolled: false }" @scroll.window="isScrolled = window.pageYOffset > 0 ? true : false">
    <nav :class="{ '{{ Request::is('/') ? 'bg-black' : '' }}': isScrolled }"
        class="{{ !Request::is('/') ? 'bg-black block' : 'absolute' }} z-50 mx-auto w-full 2xl:px-16 px-4 transition-colors duration-300 ease-in-out top-0">
        <div class="flex items-center justify-between text-white py-4 ">
            <a wire:navigate.hover href="/">
                <svg width="120" height="48" viewBox="0 0 120 48" fill="#FFFFFF" xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0_1737_1918)">
                        <mask id="mask0_1737_1918" style="mask-type:luminance" maskUnits="userSpaceOnUse" x="0" y="0"
                            width="120" height="48">
                            <path d="M119.287 0H0V48H119.287V0Z" fill="#FFFFFF" />
                        </mask>
                        <g mask="url(#mask0_1737_1918)">
                            <path
                                d="M24.3538 38.9176L11.7386 9.00974H7.71252V8.4733H21.2224V9.00974H16.7041L26.4563 32.7036L33.9269 10.798C34.2848 9.14385 34.0164 9.00974 33.2559 9.00974H30.4377V8.4733H38.8477V9.00974H36.1637C35.4032 9.00974 34.8216 9.59089 34.419 10.798L24.8458 38.9176H24.3538Z"
                                fill="#FFFFFF" />
                            <path
                                d="M33.9713 38.2918V37.7553H36.6106C37.1922 37.7553 37.729 37.1742 38.1316 36.0118L47.9732 7.89215H48.51L59.5147 37.7553H63.3619V38.2918H50.5678V37.7553H54.5492L51.2388 28.2778H41.3525L38.579 36.0118C37.9974 37.4871 38.221 37.7553 38.4448 37.7553H41.8446V38.2918H33.9713ZM41.4867 27.7861H51.0598L46.318 14.1062L41.4867 27.7861Z"
                                fill="#FFFFFF" />
                            <path
                                d="M68.5502 38.2918V37.7553H72.442V25.2825L64.3003 9.00974H60.1848V8.4733H73.7841V9.00974H69.4001L76.9155 24.1201L82.9994 10.798C83.5362 9.59089 83.3573 9.00974 82.4179 9.00974H79.5549V8.4733H87.965V9.00974H85.5046C84.6993 9.00974 83.9835 9.68029 83.3573 11.0215L77.0497 24.9696V37.7553H80.9416V38.2918H68.5502Z"
                                fill="#FFFFFF" />
                            <path
                                d="M83.7141 38.2918V37.7553H86.3535C86.935 37.7553 87.4718 37.1742 87.8744 36.0118L97.716 7.89215H98.2528L109.258 37.7553H113.105V38.2918H100.311V37.7553H104.292L100.982 28.2778H91.0952L88.3217 36.0118C87.7402 37.4871 87.9638 37.7553 88.1875 37.7553H91.5873V38.2918H83.7141ZM91.2294 27.7861H100.803L96.0608 14.1062L91.2294 27.7861Z"
                                fill="#FFFFFF" />
                        </g>
                    </g>
                    <defs>
                        <clipPath id="clip0_1737_1918">
                            <rect width="119.287" height="48" fill="#FFFFFF" />
                        </clipPath>
                    </defs>
                </svg>

            </a>
            <ul class="hidden xl:flex items-center gap-8">
                <li><a wire:navigate.hover href="/lifestyle">Vaya Lifestyle</a></li>
                <li><a wire:navigate.hover href="/news">Vaya News</a></li>
                <li><a wire:navigate.hover href="/music">Vaya Music</a></li>
                <li><a wire:navigate.hover href="/events">Събития</a></li>
                <li><a wire:navigate.hover href="/soon">Очаквайте</a></li>
                <li><a wire:navigate.hover href="/store">Магазин</a></li>
                <li><a wire:navigate.hover href="/pozdrav">Музикален поздрав</a></li>
                <li><a wire:navigate.hover href="/contacts">Контакти</a></li>
            </ul>
            <div class="hidden xl:flex">
                <a class="p-2" href="#">
                    <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 256 256">
                        <path fill="currentColor"
                            d="M234.33 69.52a24 24 0 0 0-14.49-16.4C185.56 39.88 131 40 128 40s-57.56-.12-91.84 13.12a24 24 0 0 0-14.49 16.4C19.08 79.5 16 97.74 16 128s3.08 48.5 5.67 58.48a24 24 0 0 0 14.49 16.41C69 215.56 120.4 216 127.34 216h1.32c6.94 0 58.37-.44 91.18-13.11a24 24 0 0 0 14.49-16.41c2.59-10 5.67-28.22 5.67-58.48s-3.08-48.5-5.67-58.48m-73.74 65l-40 28A8 8 0 0 1 108 156v-56a8 8 0 0 1 12.59-6.55l40 28a8 8 0 0 1 0 13.1Z" />
                    </svg>
                </a>
                <a href="" class="p-2">
                    <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24">
                        <path fill="currentColor"
                            d="M16.6 5.82s.51.5 0 0A4.278 4.278 0 0 1 15.54 3h-3.09v12.4a2.592 2.592 0 0 1-2.59 2.5c-1.42 0-2.6-1.16-2.6-2.6c0-1.72 1.66-3.01 3.37-2.48V9.66c-3.45-.46-6.47 2.22-6.47 5.64c0 3.33 2.76 5.7 5.69 5.7c3.14 0 5.69-2.55 5.69-5.7V9.01a7.35 7.35 0 0 0 4.3 1.38V7.3s-1.88.09-3.24-1.48" />
                    </svg>
                </a>
                <a href="" class="p-2">
                    <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24">
                        <path fill="currentColor"
                            d="M7.8 2h8.4C19.4 2 22 4.6 22 7.8v8.4a5.8 5.8 0 0 1-5.8 5.8H7.8C4.6 22 2 19.4 2 16.2V7.8A5.8 5.8 0 0 1 7.8 2m-.2 2A3.6 3.6 0 0 0 4 7.6v8.8C4 18.39 5.61 20 7.6 20h8.8a3.6 3.6 0 0 0 3.6-3.6V7.6C20 5.61 18.39 4 16.4 4zm9.65 1.5a1.25 1.25 0 0 1 1.25 1.25A1.25 1.25 0 0 1 17.25 8A1.25 1.25 0 0 1 16 6.75a1.25 1.25 0 0 1 1.25-1.25M12 7a5 5 0 0 1 5 5a5 5 0 0 1-5 5a5 5 0 0 1-5-5a5 5 0 0 1 5-5m0 2a3 3 0 0 0-3 3a3 3 0 0 0 3 3a3 3 0 0 0 3-3a3 3 0 0 0-3-3" />
                    </svg>
                </a>
                <a href="" class="p-2">
                    <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24">
                        <path fill="currentColor"
                            d="M22 12c0-5.52-4.48-10-10-10S2 6.48 2 12c0 4.84 3.44 8.87 8 9.8V15H8v-3h2V9.5C10 7.57 11.57 6 13.5 6H16v3h-2c-.55 0-1 .45-1 1v2h3v3h-3v6.95c5.05-.5 9-4.76 9-9.95" />
                    </svg>
                </a>
                <a href="" class="p-2">
                    <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24">
                        <path fill="currentColor"
                            d="M12.01 22A9.978 9.978 0 0 1 4.954 4.954a9.978 9.978 0 1 1 14.111 14.111A9.919 9.919 0 0 1 12.01 22Zm-1.482-6.728a9.794 9.794 0 0 1 5.227 1.384a.59.59 0 0 0 .33.1a.632.632 0 0 0 .521-.3a.7.7 0 0 0 .042-.545a.519.519 0 0 0-.293-.3a11.039 11.039 0 0 0-5.88-1.549c-1.283.01-2.56.16-3.81.449a.628.628 0 0 0-.45.749a.656.656 0 0 0 .591.472a.56.56 0 0 0 .157-.023a16.12 16.12 0 0 1 3.565-.437Zm-.19-2.976a12.648 12.648 0 0 1 6.416 1.661c.111.08.245.124.383.124c.27-.01.518-.15.668-.373a.71.71 0 0 0 .1-.586a.622.622 0 0 0-.3-.412a14.262 14.262 0 0 0-7.268-1.911a13.768 13.768 0 0 0-3.972.56a.773.773 0 0 0-.5.952a.738.738 0 0 0 .741.523a.85.85 0 0 0 .213-.025a11.66 11.66 0 0 1 3.52-.513Zm.19-3.088a14.987 14.987 0 0 1 7.376 1.7c.153.084.326.127.5.125a1 1 0 0 0 .8-.373a.985.985 0 0 0 .088-.724a.91.91 0 0 0-.436-.574a16.838 16.838 0 0 0-8.337-1.964a17.36 17.36 0 0 0-4.758.614a.915.915 0 0 0 .287 1.789a.916.916 0 0 0 .262-.038a14.7 14.7 0 0 1 4.217-.556v.001Z" />
                    </svg>
                </a>
                <a href="" class="p-2">
                    <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24">
                        <path fill="currentColor"
                            d="M17.05 20.28c-.98.95-2.05.8-3.08.35c-1.09-.46-2.09-.48-3.24 0c-1.44.62-2.2.44-3.06-.35C2.79 15.25 3.51 7.59 9.05 7.31c1.35.07 2.29.74 3.08.8c1.18-.24 2.31-.93 3.57-.84c1.51.12 2.65.72 3.4 1.8c-3.12 1.87-2.38 5.98.48 7.13c-.57 1.5-1.31 2.99-2.54 4.09zM12.03 7.25c-.15-2.23 1.66-4.07 3.74-4.25c.29 2.58-2.34 4.5-3.74 4.25" />
                    </svg>
                </a>
            </div>
            <div class="xl:hidden block" x-data="{ open: false }">

                <button @click="open = !open" class="text-white focus:outline-none">
                    <svg class="w-6 h-6" fill="none" stroke="currentColor" viewBox="0 0 24 24"
                        xmlns="http://www.w3.org/2000/svg">
                        <path stroke-linecap="round" stroke-linejoin="round" stroke-width="2"
                            d="M4 6h16M4 12h16M4 18h16"></path>
                    </svg>
                </button>
                <div x-show="open" x-transition
                    class="absolute bg-[#F7CFCD] w-full left-0 top-0 h-svh py-4 space-y-6 text-black px-4">
                    <div class="flex justify-between items-center">
                        <svg width="120" height="48" viewBox="0 0 120 48" fill="#FFFFFF"
                            xmlns="http://www.w3.org/2000/svg">
                            <g clip-path="url(#clip0_1737_1918)">
                                <mask id="mask0_1737_1918" style="mask-type:luminance" maskUnits="userSpaceOnUse"
                                    x="0" y="0" width="120" height="48">
                                    <path d="M119.287 0H0V48H119.287V0Z" fill="#FFFFFF" />
                                </mask>
                                <g mask="url(#mask0_1737_1918)">
                                    <path
                                        d="M24.3538 38.9176L11.7386 9.00974H7.71252V8.4733H21.2224V9.00974H16.7041L26.4563 32.7036L33.9269 10.798C34.2848 9.14385 34.0164 9.00974 33.2559 9.00974H30.4377V8.4733H38.8477V9.00974H36.1637C35.4032 9.00974 34.8216 9.59089 34.419 10.798L24.8458 38.9176H24.3538Z"
                                        fill="#000000" />
                                    <path
                                        d="M33.9713 38.2918V37.7553H36.6106C37.1922 37.7553 37.729 37.1742 38.1316 36.0118L47.9732 7.89215H48.51L59.5147 37.7553H63.3619V38.2918H50.5678V37.7553H54.5492L51.2388 28.2778H41.3525L38.579 36.0118C37.9974 37.4871 38.221 37.7553 38.4448 37.7553H41.8446V38.2918H33.9713ZM41.4867 27.7861H51.0598L46.318 14.1062L41.4867 27.7861Z"
                                        fill="#000000" />
                                    <path
                                        d="M68.5502 38.2918V37.7553H72.442V25.2825L64.3003 9.00974H60.1848V8.4733H73.7841V9.00974H69.4001L76.9155 24.1201L82.9994 10.798C83.5362 9.59089 83.3573 9.00974 82.4179 9.00974H79.5549V8.4733H87.965V9.00974H85.5046C84.6993 9.00974 83.9835 9.68029 83.3573 11.0215L77.0497 24.9696V37.7553H80.9416V38.2918H68.5502Z"
                                        fill="#000000" />
                                    <path
                                        d="M83.7141 38.2918V37.7553H86.3535C86.935 37.7553 87.4718 37.1742 87.8744 36.0118L97.716 7.89215H98.2528L109.258 37.7553H113.105V38.2918H100.311V37.7553H104.292L100.982 28.2778H91.0952L88.3217 36.0118C87.7402 37.4871 87.9638 37.7553 88.1875 37.7553H91.5873V38.2918H83.7141ZM91.2294 27.7861H100.803L96.0608 14.1062L91.2294 27.7861Z"
                                        fill="#000000" />
                                </g>
                            </g>
                            <defs>
                                <clipPath id="clip0_1737_1918">
                                    <rect width="119.287" height="48" fill="#FFFFFF" />
                                </clipPath>
                            </defs>
                        </svg>
                        <button @click="open = !open" class="text-black focus:outline-none block right-4 absolute">
                            <svg class="" xmlns="http://www.w3.org/2000/svg" width="36" height="36"
                                viewBox="0 0 24 24">
                                <path fill="currentColor"
                                    d="m12 13.4l-4.9 4.9q-.275.275-.7.275t-.7-.275t-.275-.7t.275-.7l4.9-4.9l-4.9-4.9q-.275-.275-.275-.7t.275-.7t.7-.275t.7.275l4.9 4.9l4.9-4.9q.275-.275.7-.275t.7.275t.275.7t-.275.7L13.4 12l4.9 4.9q.275.275.275.7t-.275.7t-.7.275t-.7-.275z" />
                            </svg>
                        </button>
                    </div>
                    <ul class="text-black flex flex-col items-center space-y-10 text-2xl">
                        <li><a wire:navigate.hover href="/">Начало</a></li>
                        <li><a wire:navigate.hover href="/lifestyle">Vaya Lifestyle</a></li>
                        <li><a wire:navigate.hover href="/news">Vaya News</a></li>
                        <li><a wire:navigate.hover href="/music">Vaya Music</a></li>
                        <li><a wire:navigate.hover href="/events">Събития</a></li>
                        <li><a wire:navigate.hover href="/soon">Очаквайте</a></li>
                        <li><a wire:navigate.hover href="/store">Магазин</a></li>
                        <li><a wire:navigate.hover href="/pozdrav">Музикален поздрав</a></li>
                        <li><a wire:navigate.hover href="/contacts">Контакти</a></li>
                    </ul>
                    <p class="text-center pt-4 text-xl">Последвайте ме</p>
                    <div class="flex mx-auto w-fit text-">
                        <a class="p-2" href="#">
                            <svg xmlns="http://www.w3.org/2000/svg" width="36" height="36"
                                viewBox="0 0 256 256">
                                <path fill="currentColor"
                                    d="M234.33 69.52a24 24 0 0 0-14.49-16.4C185.56 39.88 131 40 128 40s-57.56-.12-91.84 13.12a24 24 0 0 0-14.49 16.4C19.08 79.5 16 97.74 16 128s3.08 48.5 5.67 58.48a24 24 0 0 0 14.49 16.41C69 215.56 120.4 216 127.34 216h1.32c6.94 0 58.37-.44 91.18-13.11a24 24 0 0 0 14.49-16.41c2.59-10 5.67-28.22 5.67-58.48s-3.08-48.5-5.67-58.48m-73.74 65l-40 28A8 8 0 0 1 108 156v-56a8 8 0 0 1 12.59-6.55l40 28a8 8 0 0 1 0 13.1Z" />
                            </svg>
                        </a>
                        <a href="" class="p-2">
                            <svg xmlns="http://www.w3.org/2000/svg" width="36" height="36"
                                viewBox="0 0 24 24">
                                <path fill="currentColor"
                                    d="M16.6 5.82s.51.5 0 0A4.278 4.278 0 0 1 15.54 3h-3.09v12.4a2.592 2.592 0 0 1-2.59 2.5c-1.42 0-2.6-1.16-2.6-2.6c0-1.72 1.66-3.01 3.37-2.48V9.66c-3.45-.46-6.47 2.22-6.47 5.64c0 3.33 2.76 5.7 5.69 5.7c3.14 0 5.69-2.55 5.69-5.7V9.01a7.35 7.35 0 0 0 4.3 1.38V7.3s-1.88.09-3.24-1.48" />
                            </svg>
                        </a>
                        <a href="" class="p-2">
                            <svg xmlns="http://www.w3.org/2000/svg" width="36" height="36"
                                viewBox="0 0 24 24">
                                <path fill="currentColor"
                                    d="M7.8 2h8.4C19.4 2 22 4.6 22 7.8v8.4a5.8 5.8 0 0 1-5.8 5.8H7.8C4.6 22 2 19.4 2 16.2V7.8A5.8 5.8 0 0 1 7.8 2m-.2 2A3.6 3.6 0 0 0 4 7.6v8.8C4 18.39 5.61 20 7.6 20h8.8a3.6 3.6 0 0 0 3.6-3.6V7.6C20 5.61 18.39 4 16.4 4zm9.65 1.5a1.25 1.25 0 0 1 1.25 1.25A1.25 1.25 0 0 1 17.25 8A1.25 1.25 0 0 1 16 6.75a1.25 1.25 0 0 1 1.25-1.25M12 7a5 5 0 0 1 5 5a5 5 0 0 1-5 5a5 5 0 0 1-5-5a5 5 0 0 1 5-5m0 2a3 3 0 0 0-3 3a3 3 0 0 0 3 3a3 3 0 0 0 3-3a3 3 0 0 0-3-3" />
                            </svg>
                        </a>
                        <a href="" class="p-2">
                            <svg xmlns="http://www.w3.org/2000/svg" width="36" height="36"
                                viewBox="0 0 24 24">
                                <path fill="currentColor"
                                    d="M22 12c0-5.52-4.48-10-10-10S2 6.48 2 12c0 4.84 3.44 8.87 8 9.8V15H8v-3h2V9.5C10 7.57 11.57 6 13.5 6H16v3h-2c-.55 0-1 .45-1 1v2h3v3h-3v6.95c5.05-.5 9-4.76 9-9.95" />
                            </svg>
                        </a>
                        <a href="" class="p-2">
                            <svg xmlns="http://www.w3.org/2000/svg" width="36" height="36"
                                viewBox="0 0 24 24">
                                <path fill="currentColor"
                                    d="M12.01 22A9.978 9.978 0 0 1 4.954 4.954a9.978 9.978 0 1 1 14.111 14.111A9.919 9.919 0 0 1 12.01 22Zm-1.482-6.728a9.794 9.794 0 0 1 5.227 1.384a.59.59 0 0 0 .33.1a.632.632 0 0 0 .521-.3a.7.7 0 0 0 .042-.545a.519.519 0 0 0-.293-.3a11.039 11.039 0 0 0-5.88-1.549c-1.283.01-2.56.16-3.81.449a.628.628 0 0 0-.45.749a.656.656 0 0 0 .591.472a.56.56 0 0 0 .157-.023a16.12 16.12 0 0 1 3.565-.437Zm-.19-2.976a12.648 12.648 0 0 1 6.416 1.661c.111.08.245.124.383.124c.27-.01.518-.15.668-.373a.71.71 0 0 0 .1-.586a.622.622 0 0 0-.3-.412a14.262 14.262 0 0 0-7.268-1.911a13.768 13.768 0 0 0-3.972.56a.773.773 0 0 0-.5.952a.738.738 0 0 0 .741.523a.85.85 0 0 0 .213-.025a11.66 11.66 0 0 1 3.52-.513Zm.19-3.088a14.987 14.987 0 0 1 7.376 1.7c.153.084.326.127.5.125a1 1 0 0 0 .8-.373a.985.985 0 0 0 .088-.724a.91.91 0 0 0-.436-.574a16.838 16.838 0 0 0-8.337-1.964a17.36 17.36 0 0 0-4.758.614a.915.915 0 0 0 .287 1.789a.916.916 0 0 0 .262-.038a14.7 14.7 0 0 1 4.217-.556v.001Z" />
                            </svg>
                        </a>
                        <a href="" class="p-2">
                            <svg xmlns="http://www.w3.org/2000/svg" width="36" height="36"
                                viewBox="0 0 24 24">
                                <path fill="currentColor"
                                    d="M17.05 20.28c-.98.95-2.05.8-3.08.35c-1.09-.46-2.09-.48-3.24 0c-1.44.62-2.2.44-3.06-.35C2.79 15.25 3.51 7.59 9.05 7.31c1.35.07 2.29.74 3.08.8c1.18-.24 2.31-.93 3.57-.84c1.51.12 2.65.72 3.4 1.8c-3.12 1.87-2.38 5.98.48 7.13c-.57 1.5-1.31 2.99-2.54 4.09zM12.03 7.25c-.15-2.23 1.66-4.07 3.74-4.25c.29 2.58-2.34 4.5-3.74 4.25" />
                            </svg>
                        </a>
                    </div>
                </div>
            </div>
        </div>
    </nav>
</div>
